Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/studying_abroad/studying_in_the_uk_including_northern_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Studying in the UK including Northern Ireland
ga: Ag staidéar sa Bhreatain agus i dTuaisceart Éireann

source: If you are currently living in Ireland and thinking of doing a third-level course in Northern Ireland (NI) or elsewhere in the United Kingdom (UK) there is a very wide range of courses available
ga: Má tá tú i do chónaí in Éirinn faoi láthair agus ag smaoineamh cúrsa tríú leibhéal a dhéanamh i dTuaisceart Éireann nó áit éigin eile sa Bhreatain tá rogha mór cúrsaí ar fáil

source: Many people choose to study in the UK because a particular course is not available in Ireland or because the entry requirements are easier
ga: Roghnaíonn go leor daoine staidéar a dhéanamh sa Bhreatain mar nach bhfuil cúrsa áirithe ar fáil in Éirinn nó mar gheall go bhfuil na riachtanais iontrála níos éasca

source: Others want to have the experience of studying outside Ireland
ga: Tá daoine eile ag iarraidh an taithí bheith ag staidéar taobh amuigh de Éirinn

source: Before you apply you should find out about the different structures and costs for third-level education in the UK (pdf), in particular fees and living costs
ga: Sula ndéanann tú iarratas ba chóir duit fáil amach faoina struchtúir dhifriúla agus na costais a bhaineann le oideachas tríú leibhéal sa Ríocht Aontaithe (pdf), go háirithe táillí agus costais maireachtála

source: For example, there are different fee arrangements within the UK
ga: Mar shampla, tá socraithe difriúla do tháillí laistigh den Ríocht Aontaithe

source: The United Kingdom (UK) includes England, Wales, Scotland and Northern Ireland
ga: Taobh istigh den Ríocht Aontaithe tá Sasana, An Bhreatain Bheag, An Albain agus Tuaisceart Éireann

source: Most UK undergraduate courses last 3 years but in Scotland they last 4 years
ga: Maireann an chuid is mó de na cúrsaí fochéimithe sa Ríocht Aontaithe trí bliana ach san Albain maireann siad cheithre bliana

source: In addition the application process starts earlier than in Ireland
ga: Freisin tosaíonn an próiseas ar iarratas a dhéanamh níos luaithe ná in Éirinn

source: This means you should begin looking at courses at least 12 months before you plan to start studying
ga: Ciallaíonn sé seo gur chóir duit tosnú ag féachaint ar chúrsaí 12 mí ar a laghad sula bhfuil sé i gceist agat tosnú ag staidéar

source: The application procedure for all UK undergraduate courses is the same (see below for further details)
ga: Tá an próiseas chun iarratas a dhéanamh ar gach chúrsaí fochéimithe sa Ríocht Aontaithe mar an gcéanna (féach thíosluaite chun tuilleadh eolais a fháil)

source: If you do not know the course you wish to study or if you want to find out about different courses or colleges there are useful online resources to guide you
ga: Mura bhfuil fhios agat an cúrsa atá uait nó má tá tú ag iarraidh a fháil amach faoina cúrsaí agus coláistí difriúla tá acmhainní úsáideacha ar an idirlín chun treoir a thabhairt duit

source: The British Council website Education UK allows you to search for undergraduate and postgraduate courses on a particular subject, in a particular university or in a specific area such as Northern Ireland
ga: Tugann an suíomh gréasáin EducationUK na Comhairle na Breataine cúnamh duit cúrsaí fochéime agus iarchéime ar ábhair áirithe a chuartú, in ollscoil áirithe nó áit ar leith ar nós Tuaisceart Éireann

source: It contains a summary of information about each college or university with contact details and you can make online request for brochures about the courses
ga: Tá achoimre eolais faoi chuile choláiste nó ollscoil le sonraí teagmhálacha ann agus tá tú ábalta iarratas a dhéanamh ar an idirlín chun lámhleabhair eolais a fháil ar na cúrsaí

source: It also has general information about living in the UK including accommodation and working while studying
ga: Tá eolas ghinearálta ann freisin faoi mhaireachtáil sa Ríocht Aontaithe (RA), le heolas faoi lóistín agus ag obair fhad agus atá tú ag staidéar ar chuid de

source: You can find information about UK higher education institutions and courses on the GOV.UK website
ga: Is féidir leat eolas faoi institiúidí agus cúrsaí ardoideachas sa RA a fháil ar an suíomh gréasáin GOV.UK

source: Applying for an undergraduate course
ga: Ag déanamh iarratais ar chúrsa fochéime

source: You may be eligible for a maintenance grant if you meet the criteria for the Student Grant Scheme - see 'How to apply' below
ga: B’fhéidir go bhfuil tú i dteideal deontas cothabhála a fháil má chomhlíonann tú na critéir don Scéim Deontas Mac Léinn – féach ‘Conas iarratas a dhéanamh’ thíos

source: UCAS (University and Colleges Admissions Service) is the central applications body for full-time undergraduate courses at UK universities and colleges
ga: UCAS (University and Colleges Admissions Service) Is é seo an foras lárnach do iarratais ar chúrsaí fochéimithe lán aimseartha do ollscoileanna agus coláistí sa Ríocht Aontaithe

source: Its website contains all the information you need to apply to college including: how to apply, fees and information about the colleges
ga: Tá gach eolas a theastaíonn uait chun iarratas a dhéanamh ar áit i gcoláiste ar an suíomh idirlín seo, lena n-áirítear: conas iarratas a dhéanamh, táillí agus eolas faoi choláistí

source: Applications must be made online through the UCAS website
ga: Caithfidh tú iarratas a dhéanamh ar an idirlíon tríd suíomh idirlín UCAS

source: You can apply through your school or as an individual
ga: Is féidir iarratas a dhéanamh trí do scoil nó i do aonar

source: Use the UCAS tariff calculator which is a points system used for entry to higher education
ga: Úsáid áireamhán an UCAS atá ina chóras pointí atá anseo a úsáidtear mar mhodh iontrála chuig ardoideachas

source: It allows you to compare Leaving Certificate and GCSE A level grades
ga: Tugann sé deis duit comparáid a dhéanamh idir grádanna na hArdteistiméireachta agus an GCSE leibhéal A

source: A Leaving Certificate subject at honours level is approximately equivalent to two-thirds of an A level
ga: Tá ábhar ardteistiméireachta ag leibhéal onóracha mórán mar an chéile le dhá trian de leibhéal A

source: There is a complete list of dates for applications on the UCAS website
ga: Tá liosta iomlán de spriocdhátaí na n-iarratas ar shuíomh idirlín UCAS

source: There are 2 types of postgraduate study: taught courses and research
ga: Tá dhá chineál staidéar iarchéimithe ann: Cúrsaí múinte agus taighde

source: Taught courses often last just 1 year while research can continue for 3 years or more
ga: Is iondúil nach maireann cúrsaí múinte ach bliain amháin ach d'fhéadfadh taighde maireachtáil trí bliana nó níos mó

source: You need to consider what kind of postgraduate study you wish to do, what are the most suitable courses for you and your career and what costs are involved
ga: Caithfidh tú smaoineamh cén sórt cúrsa iarchéime gur mhaith leat a dhéanamh, céard iad na cúrsaí is feiliúnaí dhuitse agus do shlí beatha, agus cad iad na costais

source: Prospects is the official graduate prospects website for the UK
ga: Ionchas Is é seo an suíomh idirlín oifigiúil ionchais céimnithe sa Ríocht Aontaithe

source: It has information on postgraduate study, jobs and career advice
ga: Tá eolas ann faoi staidéar iarchéime, postanna agus comhairle maidir le do shlí bheatha

source: It has information on full-time and part-time courses and you can search by geographical area and by subject
ga: Tá eolas ann faoi chúrsaí lánaimseartha agus páirtaimseartha agus is féidir leat iad a chuartú faoin ábhar nó faoi áit

source: For postgraduate courses in the UK you apply directly to the university or college
ga: I gcás cúrsaí iarchéime sa Ríocht Aontaithe déanann tú iarratas díreach chuig an ollscoil nó an coláiste

source: Most of them have the application forms available online
ga: Tá foirmeacha iarratais ag an gcuid is mó acu ar an idirlíon

source: As an EU national you will be treated in the same way as regards fees as UK students
ga: Mar náisiúnach de chuid an AE déileáilfear leat maidir le táillí ar an gcaoi chéanna is a déileáilfear le micléinn de chuid na Ríocht Aontaithe

source: Tuition fees are not the only expense when studying in the UK you also need to consider accommodation and living costs
ga: Ní táillí teagaisc amháin an t-aon costas agus tú ag staidéar sa Ríocht Aontaithe - caithfidh tú costais lóistíne agus maireachtála a chur san áireamh freisin

source: England, Wales and Northern Ireland: Since 2012-2013 universities and colleges can charge new students up to £9,000 sterling a year for undergraduate courses
ga: Sasana, An Bhreatain Bheag agus Tuaisceart Éireann: I 2012-2013 is féidir le hollscoileanna agus coláistí £9,000 sterling sa bhliain a ghearradh ar mhicléinn nua i gcúrsaí fochéimithe

source: You can apply for a tuition fee loan which you only have to repay after you have graduated and are earning over £21,000 sterling a year
ga: Tá tú in ann iarratas a dhéanamh ar iasacht táille teagaisc nach gá dhuit aisíoc go dtí go mbeidh do chéim bainte amach agat agus thú ag saothrú ós cionn £21,000 sterling sa bhliain

source: However, you are not entitled to maintenance support in the same way as home students
ga: Ach, níl tú i dteideal tacaíocht cothabhála sa gcaoi chéanna le micléinn baile

source: If you are an EU national who has been settled in the UK for over 3 years you will be classed as a home student and will be able to apply for financial support for living costs
ga: Más náisiúnach de chuid an AE tú atá ag cur fút sa Ríocht Aontaithe le os cionn trí bliana, breathnaítear ort mar mhicléinn baile agus beidh tú in ann cur isteach ar thacaíocht airgid do chostaisí maireachtála

source: Scotland: Scottish students and EU students who start their first full-time degree course in Scotland do not pay fees as long as they meet the relevant residence criteria (pdf)
ga: An Albain: Ní íocann mic léinn na hAlban agus mic léinn an AE a thosaíonn a gcéad chúrsa céime lánaimseartha san Albain táillí a fhad agus go gcomhlíonann siad na critéir ábhartha chónaithe (pdf)

source: The tuition fees for postgraduate study vary from institution to institution and course to course, but usually run to several thousand pounds
ga: Tá na táillí teagaisc do chúrsaí iarchéime éagsúil ó institiúid amháin go hinstitiúid eile, agus ó choláiste go coláiste, ach go hiondúil bíonn sé thart ar chúpla míle punt sterling

source: Postgraduate prospectuses give up-to-date fees
ga: Tugann réamheolairí na n-iarchéimeanna na táillí is reathúla

source: There are different sources of funding for postgraduate students
ga: Tá foinsí maoinithe éagsúil do mhicléinn iarchéime

source: Some courses are advertised in the newspapers and include funding
ga: Fógraítear roinnt cúrsaí sna páipéir nuachta agus bíonn maoiniú mar chuid de

source: Sometimes financial support is available from the university that is running the postgraduate course; sometimes you need to apply to an external body
ga: Amannta bíonn tacaíocht airgid ar fáil san ollscoil atá ag rith an chúrsa iarchéime; amannta eile bíonn ort iarratas a dhéanamh chuig foras lasmuigh

source: Awards are available for a range of subjects, both for taught courses and research programmes
ga: Tá duaiseanna ar fáil do ábhair éagsúil, i gcúrsaí atá múinte agus i gcláracha taighde

source: They vary as to amount, duration and whether they only cover fees or include maintenance as well
ga: Tá siad seo éagsúil maidir le méid, fad agus má chlúdaíonn siad táillí amháin nó costais cothabhála chomh maith

source: There are strict eligibility rules and deadlines for application and you should be aware that there are a large number of postgraduates competing for limited funding
ga: Tá rialacha déine maidir le cead iarratais agus sprioc am an iarratais. Freisin, tá líon mór iarchéimithe ag dul in iomaíocht le chéile don mhaoiniú teoranta

source: A number of scholarships and fellowships for study abroad are awarded annually by foreign governments to Irish students who are engaged in, or have completed a course of third-level education
ga: Tá roinnt scoláireachtaí agus ánrachtaí chun staidéar thar lear bronnta chuile bhliain ag rialtais eachtrannacha ar mhicléinn Éireannacha atá i mbun cúrsa tríú leibhéal nó atá críochnaithe leis

source: Further information may be obtained from the International Section of the Department of Education and Skills - see 'Where to apply' below
ga: Is féidir tuilleadh eolais a fháil ón Rannóg Idirnáisiúnta den Roinn Oideachas agus Scileanna - féach "Conas iarratas a dhéanamh" thíos

source: Check the following websites which have information on postgraduate funding:
ga: Seiceáil na suíomhanna idirlín seo leanas ar a bhfuil eolas maidir le maoiniú iarchéime:

source: If you need help or advice on your UCAS application contact the Customer Service Unit and remember to quote your UCAS Personal ID/application number
ga: Má tá cúnamh nó comhairle uait le do iarratas UCAS déan teagmháil le Aonad Seirbhíse do Chustaiméirí agus cuimhnigh go gcaithfidh tú do uimhir Phearsanta a thabhairt

source: If you are an EU student, and applying through UCAS, they will send you an application form for a tuition fee loan when you are offered a place on a course
ga: Más macléinn ón AE thú, agus ag déanamh iarratas tríd UCAS, cuirfidh siad foirm iarratais do iasacht do na táillí teagaisc chugat nuair a thairiscíonn siad áit duit ar an gcúrsa

source: You may be eligible for a maintenance grant if you meet the criteria for the Irish Student Grant Scheme but this does not include funding for tuition fees. You may claim tax relief on third-level fees
ga: B’fhéidir go bhfuil tú i dteideal deontas cothabhála a fháil má chomhlíonann tú na critéir do Scéim Deontas Mac Léinn Éireannach, ach ní áirítear leis seo cistiú do tháillí teagaisc

source: There is detailed information on the range of Irish grants and funds for students in further and higher education at studentfinance.ie
ga: Mura bhfuil tú i dteideal deontas cothabhála is féidir leat iarratas a dhéanamh ar fhaoiseamh cánach ar tháillí tríú leibhéal

source: The GOV.UK website has information on the financial supports available for EU students studying in the UK including Northern Ireland
ga: Tá faisnéis mionsonraithe faoi dheontais agus chistí do mhic léinn san ardoideachas agus breisoideachas ar studentfinance.ie

source: Funding is available under the Student Grant Scheme for postgraduate study in Northern Ireland but not for postgraduate study in Britain
ga: Tugann Scéim singil um Dheontais do Mhic Léinn maoiniú i gcomhair staidéar iarchéime i dTuaisceart Éireann ach ní do staidéar iarchéime sa Bhreatain

source: You may claim tax relief on third-level fees
ga: Is féidir leat faoiseamh cánach a iarraidh ar na táillí tríú leibhéal
